Documents/ПоступлениеПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПоступлениеПлатежей</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>InformationRegister.ХранилищеДанныхТабличныхДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересчитать</Name>
					<Comment>Если признак установлен, сумма в валюте регламентного учета будет пересчитана</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаВПроизвольнойВалюте</Name>
					<Comment>Если признак не установлен, задолженность будет загружена в валюте ДО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеПлатежа</Name>
							<Comment>Сумма в валюте платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойДолг</Name>
							<Comment>Сумма в валюте загрузки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрафы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыборСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеПлатежей/Ext/ObjectModule.bsl
Процедура ОбработкаУдаленияПроведения(Отказ)
	//ПроведениеСервер.ОчиститьДвиженияДокумента(ЭтотОбъект,, Отказ);   
		
	//Корректировка последовательности, поиск первого документа актуализации и его ПРОГРАММНОЕ перепроведение
  	Документы.АктуализацияЗадолженности.ПровестиПоследовательность(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаРегл = Справочники.Валюты.ПустаяСсылка() Тогда
		Сообщить("Не определена валюта регламентированного учета!");
		Отказ = Истина;     
	КонецЕсли;
	
	ТаблицаДвиженийОбъекты = Неопределено;
	ТаблицаДвиженийСобытия = Неопределено;
	
	Документы.ПоступлениеПлатежей.ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, 
			ТаблицаДвиженийСобытия);
		
	Если Не Отказ И ТаблицаДвиженийОбъекты.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Загрузить(ТаблицаДвиженийОбъекты);
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Записывать = Истина;
	КонецЕсли;		
			
	Если Не Отказ И ТаблицаДвиженийСобытия.Количество() > 0 Тогда
		ЭтотОбъект.Движения.СобытияПоОбъектам.Загрузить(ТаблицаДвиженийСобытия);
		ЭтотОбъект.Движения.СобытияПоОбъектам.Записывать = Истина;
	КонецЕсли;		
			
	ЭтотОбъект.Движения.Записать();	
	
	//Корректировка последовательности, поиск первого документа актуализации и его ПРОГРАММНОЕ перепроведение
  	Документы.АктуализацияЗадолженности.ПровестиПоследовательность(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ЗаполнитьДанные(ПолеИмпорта, НастройкаСоответствий) Экспорт
	СписокРеквизитов = Новый СписокЗначений;
	//ФормаДокумента = ПолучитьФорму("Документ.ПоступлениеПлатежей.Форма.ФормаДокумента");
	//ТзДанныеЭлементы = ФормаДокумента.Элементы.Объекты.ПодчиненныеЭлементы;
	//Для Каждого Элемент Из ТзДанныеЭлементы Цикл	
	//	Имя = Сред(Элемент.Имя, СтрДлина("Объекты") + 1);
	//	Попытка   
	//		Если Элемент.Заголовок = "" Тогда
	//			Синоним = Метаданные.Документы.ПоступлениеПлатежей.ТабличныеЧасти.Объекты.Реквизиты.Найти(Имя).Синоним;
	//		Иначе 
	//			Синоним = Элемент.Заголовок;
	//		КонецЕсли;		
	//		//Элементы.ВыборСоответствий.ПодчиненныеЭлементы.ВыборСоответствийИмяДанных.СписокВыбора.Добавить(Синоним);			
	//		СписокРеквизитов.Добавить(Имя,Синоним);
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла; 	
	
	СписокРеквизитов.Добавить("ДатаПлатежа", "Дата платежа");
	СписокРеквизитов.Добавить("Объект", "Объект");
	СписокРеквизитов.Добавить("ВалютаПлатежа", "Валюта платежа");
	СписокРеквизитов.Добавить("СуммаВВалютеПлатежа", "Сумма в валюте платежа");
	СписокРеквизитов.Добавить("ОсновнойДолг", "Основной долг");
	СписокРеквизитов.Добавить("Проценты", "Проценты");
	СписокРеквизитов.Добавить("Штрафы", "Штрафы");
	СписокРеквизитов.Добавить("Пени", "Пени");
	СписокРеквизитов.Добавить("Составляющая1", "Составляющая1");
	СписокРеквизитов.Добавить("Составляющая2", "Составляющая2");
	СписокРеквизитов.Добавить("Составляющая3", "Составляющая3");
	СписокРеквизитов.Добавить("Составляющая4", "Составляющая4");
	СписокРеквизитов.Добавить("Составляющая5", "Составляющая5");
	СписокРеквизитов.Добавить("Составляющая6", "Составляющая6");
	СписокРеквизитов.Добавить("Составляющая7", "Составляющая7");
	СписокРеквизитов.Добавить("Составляющая8", "Составляющая8");
		
	Для НомерСтрокиТаблицыИмпорта = 2 По ПолеИмпорта.ВысотаТаблицы Цикл
		ПустаяСтрокаТаблицы = Истина;
		Для НомерСтолбца = 1 По ПолеИмпорта.ШиринаТаблицы Цикл
			Если ЗначениеЗаполнено(ПолеИмпорта.Область("R" + Формат(НомерСтрокиТаблицыИмпорта, "ЧГ=") + "C" + 
					Формат(НомерСтолбца, "ЧГ=")).Текст) Тогда
				ПустаяСтрокаТаблицы = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПустаяСтрокаТаблицы Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ЭтотОбъект.Объекты.Добавить(); 
		Для Каждого ТекСтрока Из НастройкаСоответствий.ВыборСоответствий Цикл
			Если Не ЗначениеЗаполнено(ТекСтрока.ПараметрыСвязи) Тогда
				Продолжить;
			КонецЕсли;
			                         
			Если ТекСтрока.ТипДанных = "Строка" Тогда
				Для Каждого Элемент Из СписокРеквизитов Цикл
					Если Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						НоваяСтрока[Элемент.Значение] = РаботаСДокументами.СформироватьСтрокуИзДанных82(ТекСтрока.ПараметрыСвязи, 
								НомерСтрокиТаблицыИмпорта, ПолеИмпорта);
						Прервать;
					КонецЕсли
				КонецЦикла;	
				
			ИначеЕсли ТекСтрока.ТипДанных = "Число" Тогда
				Попытка
					Результат = Число(СтрЗаменить(РаботаСДокументами.НайтиЗначениеВТаблицеИмпорта(НомерСтрокиТаблицыИмпорта, 
							ТекСтрока.ПараметрыСвязи, ПолеИмпорта), " ", ""));
				Исключение
					Результат = 0;
				КонецПопытки;
				
				Для Каждого Элемент Из СписокРеквизитов Цикл
					Если Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						НоваяСтрока[Элемент.Значение] = Результат;
						Прервать;
					КонецЕсли
				КонецЦикла;
				
			ИначеЕсли ТекСтрока.ТипДанных = "Дата" Тогда
				Попытка
					Результат = Дата(РаботаСДокументами.НайтиЗначениеВТаблицеИмпорта(НомерСтрокиТаблицыИмпорта, 
							ТекСтрока.ПараметрыСвязи, ПолеИмпорта));
				Исключение
					Результат = Технический.ПреобразоватьДату(РаботаСДокументами.НайтиЗначениеВТаблицеИмпорта(
							НомерСтрокиТаблицыИмпорта, ТекСтрока.ПараметрыСвязи, ПолеИмпорта));
				КонецПопытки;
						
				Для Каждого Элемент Из СписокРеквизитов Цикл
					Если Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						НоваяСтрока[Элемент.Значение] = Результат;
						Прервать;
					КонецЕсли
				КонецЦикла;
					
			//ИначеЕсли Найти(ТекСтрока.ТипДанных,  "Перечисление ссылка:") = 1 
			//		Или НРег(ТекСтрока.ТипДанных) = Нрег(Строка(Тип("СправочникСсылка.тсЗначенияСвойствОбъектов"))) 
			//		Или ТекСтрока.ТипДанных = "Булево" Тогда
			//	НайтиИЗаписатьПеречисление(ТекСтрока, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта);
				       
			Иначе	
			    Для Каждого Элемент Из СписокРеквизитов Цикл
					Если ТекСтрока.ИмяДанных = "Должник" Тогда
						РаботаСДокументами.НайтиИЗаписатьДокументИлиСправочник81("Объект", ТекСтрока.ТипДанных, 
								ТекСтрока.ПараметрыСвязи, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта);
						ВладелецДолжник = НоваяСтрока.Объект;
						// Боевкин 07.07.2017 
						// НоваяСтрока.Объект = Неопределено;
						////////////////////////////////////
						Прервать;
					ИначеЕсли ТекСтрока.ИмяДанных = "Долговое обязательство" Тогда
						РаботаСДокументами.НайтиИЗаписатьДокументИлиСправочник81("Объект", ТекСтрока.ТипДанных, 
								ТекСтрока.ПараметрыСвязи, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта, 
								ВладелецДолжник);
						Прервать;
					ИначеЕсли Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						РаботаСДокументами.НайтиИЗаписатьДокументИлиСправочник81(Элемент.Значение, ТекСтрока.ТипДанных, 
								ТекСтрока.ПараметрыСвязи, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта);		
						Прервать;
					КонецЕсли;		
				КонецЦикла;				
			КонецЕсли;
		КонецЦикла;
		Если не ЗначениеЗаполнено(НоваяСтрока.ДатаПлатежа) ИЛИ Не ЗначениеЗаполнено(НоваяСтрока.Объект) Тогда
			ЭтотОбъект.Объекты.Удалить(НоваяСтрока.НомерСтроки-1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
